Revit 2027 API
ColorWithTransparency.SetGreen Method
 set green
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetGreen(
	uint green
)
Public Sub SetGreen (
	green As UInteger
)
public:
void SetGreen(
	unsigned int green
)
member SetGreen :
        green : uint32 -> unit
Parameters
green UInt32
 green
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The value is not valid. The valid range is 0 to 255.
See Also
Reference
ColorWithTransparency Class
Autodesk.Revit.DB Namespace